{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "137b3ca8",
   "metadata": {},
   "source": [
    "# Opis\n",
    "Ten notes zawiera funkcje do łączenia i eksplorowania danych. Najpierw dane łączone są w jeden graf wiedzy, a następnie wykonywane są na nich różne zapytania.\n",
    "## Opisy poszczególnych funkcji\n",
    "\n",
    "- create_graph(directory_path_with_rdfs)\n",
    "\n",
    "    Tworzy graf z danymi z plików `.rdf`.\n",
    "\n",
    "    Wymagane parametry:\n",
    "    - **directory_path_with_rdfs** - ścieżka do folderu z plikami w formacie `.rdf`\n",
    "\n",
    "- visualise_graph(graph):\n",
    "\n",
    "    Tworzy plik html z wizualizacją grafu.\n",
    "\n",
    "    Wymagane parametry:\n",
    "    - **graph** - graph stworzony przez `create_graph()`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "bd33f286",
   "metadata": {},
   "outputs": [],
   "source": [
    "from rdflib import Graph, Namespace\n",
    "import glob"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "3345de9c",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_graph(directory_path_with_rdfs, generate_files):\n",
    "    graph = Graph()\n",
    "\n",
    "    for rdf_file in glob.glob(directory_path_with_rdfs):\n",
    "        graph.parse(rdf_file)\n",
    "    print(f\"Łącznie wczytano {len(graph)} trójek.\")\n",
    "\n",
    "    if generate_files:\n",
    "        graph.serialize(\"./data/merged_graph.rdf\", format=\"xml\")\n",
    "        graph.serialize(\"./data/merged_graph_turtle.ttl\", format=\"turtle\")\n",
    "\n",
    "    return graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "ca9b9d4a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Łącznie wczytano 3388 trójek.\n"
     ]
    }
   ],
   "source": [
    "rdfs_directory_path = \"./data/part1/*rdf\"\n",
    "g = create_graph(rdfs_directory_path, False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "56d93b9e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://purl.org/dc/elements/1.1/coverage\n",
      "http://purl.org/dc/elements/1.1/creator\n",
      "http://purl.org/dc/elements/1.1/date\n",
      "http://purl.org/dc/elements/1.1/description\n",
      "http://purl.org/dc/elements/1.1/format\n",
      "http://purl.org/dc/elements/1.1/identifier\n",
      "http://purl.org/dc/elements/1.1/issued\n",
      "http://purl.org/dc/elements/1.1/language\n",
      "http://purl.org/dc/elements/1.1/publisher\n",
      "http://purl.org/dc/elements/1.1/relation\n",
      "http://purl.org/dc/elements/1.1/rights\n",
      "http://purl.org/dc/elements/1.1/source\n",
      "http://purl.org/dc/elements/1.1/subject\n",
      "http://purl.org/dc/elements/1.1/title\n",
      "http://purl.org/dc/elements/1.1/type\n"
     ]
    }
   ],
   "source": [
    "# właściwości używane w grafie\n",
    "\n",
    "q = \"\"\"\n",
    "SELECT DISTINCT ?p WHERE {\n",
    "    ?s ?p ?o .\n",
    "}\n",
    "ORDER BY ?p\n",
    "\"\"\"\n",
    "for row in g.query(q):\n",
    "    print(row[0])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "a62938e0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "**********dc:coverage**********\n",
      "20 w.\n",
      "19 w.\n",
      "19-20 w.\n",
      "20-21 w.\n",
      "\n",
      "**********dc:type**********\n",
      "rozprawa doktorska\n",
      "druk ulotny\n",
      "afisz\n",
      "plakat\n",
      "klepsydra\n",
      "\n",
      "**********dc:creator**********\n",
      "Gęsiak, Leszek\n",
      "Labour Party\n",
      "Cambridge Anglo-Polish Society\n",
      "\n",
      "**********dc:format**********\n",
      "image/x.djvu\n",
      "image/x.djvu\n",
      "application/octet-stream\n",
      "application/octet-stream\n",
      "pdf\n",
      "\n",
      "**********dc:publisher**********\n",
      "Uniwersytet Jagielloński w Krakowie\n",
      "I. Związkowa Drukarnia\n",
      "Jermułowicz i Bergman\n",
      "M. Stochalski\n",
      "\n",
      "**********dc:relation**********\n",
      "oai:jbc.bj.uj.edu.pl:publication:180039\n",
      "oai:jbc.bj.uj.edu.pl:publication:180039\n",
      "oai:jbc.bj.uj.edu.pl:publication:421001\n",
      "oai:jbc.bj.uj.edu.pl:publication:421001\n",
      "oai:jbc.bj.uj.edu.pl:publication:535690\n",
      "oai:jbc.bj.uj.edu.pl:publication:535691\n",
      "oai:jbc.bj.uj.edu.pl:publication:579328\n",
      "oai:jbc.bj.uj.edu.pl:publication:579397\n",
      "oai:jbc.bj.uj.edu.pl:publication:579399\n",
      "oai:jbc.bj.uj.edu.pl:publication:579419\n",
      "oai:jbc.bj.uj.edu.pl:publication:599804\n",
      "oai:jbc.bj.uj.edu.pl:publication:599842\n",
      "oai:jbc.bj.uj.edu.pl:publication:599998\n",
      "oai:jbc.bj.uj.edu.pl:publication:600001\n",
      "oai:jbc.bj.uj.edu.pl:publication:600002\n",
      "oai:jbc.bj.uj.edu.pl:publication:600330\n",
      "oai:jbc.bj.uj.edu.pl:publication:600353\n",
      "oai:jbc.bj.uj.edu.pl:publication:601649\n",
      "oai:jbc.bj.uj.edu.pl:publication:601724\n",
      "https://audiovis.nac.gov.pl/search/bce12eb58b7c438c284cce758f457f0c:1/ Zobacz w NAC, Fragment przedstawienia Ludwika Hieronima Morstina „Mikołaj Kopernik” (1936-1937)\n",
      "\n",
      "**********dc:subject**********\n",
      "religion\n",
      "society\n",
      "wartości rdzenne\n",
      "state\n",
      "państwo\n",
      "core values\n",
      "wielokulturowość\n",
      "multiculturalism\n",
      "społeczeństwo\n",
      "religia\n",
      "laburzyści\n",
      "Partia Pracy (Wielka Brytania)\n",
      "druki ulotne 20 w.\n",
      "Ciołkosz, Adam (1901-1978)\n",
      "druki ulotne 19 w.\n",
      "Wydawnictwo „Czytelni Ludowej”\n",
      "Teatr Krakowski 19 w.\n",
      "Sienkiewicz, Henryk (1846-1916)\n",
      "Chaumont, Céline (1848-1926)\n",
      "Towarzystwo Paryskie\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# sprawdzenie wartości dla kilku właściwości\n",
    "\n",
    "fields = [\"dc:coverage\", \"dc:type\", \"dc:creator\", \"dc:format\", \"dc:publisher\", \"dc:relation\", \"dc:subject\"]\n",
    "\n",
    "dc = Namespace(\"http://purl.org/dc/elements/1.1/\")\n",
    "\n",
    "for field in fields:\n",
    "    q = f\"\"\"\n",
    "    SELECT DISTINCT ?value WHERE {{\n",
    "        ?s {field} ?value .\n",
    "    }}\n",
    "    LIMIT 20\n",
    "    \"\"\"\n",
    "    print(10*\"*\"+field+10*\"*\")\n",
    "    for row in g.query(q, initNs={\"dc\": dc}):\n",
    "        print(row[0])\n",
    "    print()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "3070b1d8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "--- DOCUMENT ---\n",
      "http://purl.org/dc/elements/1.1/publisher → Uniwersytet Jagielloński w Krakowie\n",
      "http://purl.org/dc/elements/1.1/subject → religion\n",
      "http://purl.org/dc/elements/1.1/subject → society\n",
      "http://purl.org/dc/elements/1.1/subject → wartości rdzenne\n",
      "http://purl.org/dc/elements/1.1/subject → state\n",
      "http://purl.org/dc/elements/1.1/subject → państwo\n",
      "http://purl.org/dc/elements/1.1/subject → core values\n",
      "http://purl.org/dc/elements/1.1/subject → wielokulturowość\n",
      "http://purl.org/dc/elements/1.1/subject → multiculturalism\n",
      "http://purl.org/dc/elements/1.1/subject → społeczeństwo\n",
      "http://purl.org/dc/elements/1.1/subject → religia\n",
      "http://purl.org/dc/elements/1.1/relation → oai:jbc.bj.uj.edu.pl:publication:180039\n",
      "http://purl.org/dc/elements/1.1/relation → oai:jbc.bj.uj.edu.pl:publication:180039\n",
      "http://purl.org/dc/elements/1.1/format → image/x.djvu\n",
      "http://purl.org/dc/elements/1.1/format → image/x.djvu\n",
      "http://purl.org/dc/elements/1.1/creator → Gęsiak, Leszek\n",
      "http://purl.org/dc/elements/1.1/source → Archiwum UJ, Dokt. 2004/193\n",
      "http://purl.org/dc/elements/1.1/rights → Copyright\n",
      "http://purl.org/dc/elements/1.1/issued → 2004\n",
      "http://purl.org/dc/elements/1.1/type → rozprawa doktorska\n",
      "http://purl.org/dc/elements/1.1/title → Wielokulturowość - rola religii w dynamice zjawiska\n",
      "http://purl.org/dc/elements/1.1/date → 2004\n",
      "http://purl.org/dc/elements/1.1/language → pol\n",
      "\n",
      "--- DOCUMENT ---\n",
      "http://purl.org/dc/elements/1.1/title → „Your Future”\n",
      "http://purl.org/dc/elements/1.1/source → Biblioteka Jagiellońska, 639986 III 110\n",
      "http://purl.org/dc/elements/1.1/date → ca 1946\n",
      "http://purl.org/dc/elements/1.1/issued → ca 1946\n",
      "http://purl.org/dc/elements/1.1/relation → oai:jbc.bj.uj.edu.pl:publication:421001\n",
      "http://purl.org/dc/elements/1.1/relation → oai:jbc.bj.uj.edu.pl:publication:421001\n",
      "http://purl.org/dc/elements/1.1/language → eng\n",
      "http://purl.org/dc/elements/1.1/creator → Labour Party\n",
      "http://purl.org/dc/elements/1.1/subject → laburzyści\n",
      "http://purl.org/dc/elements/1.1/subject → Partia Pracy (Wielka Brytania)\n",
      "http://purl.org/dc/elements/1.1/subject → druki ulotne 20 w.\n",
      "http://purl.org/dc/elements/1.1/coverage → 20 w.\n",
      "http://purl.org/dc/elements/1.1/type → druk ulotny\n",
      "http://purl.org/dc/elements/1.1/rights → Domena publiczna (public domain)\n",
      "http://purl.org/dc/elements/1.1/format → application/octet-stream\n",
      "http://purl.org/dc/elements/1.1/format → application/octet-stream\n",
      "http://purl.org/dc/elements/1.1/identifier → https://jbc.bj.uj.edu.pl/Content/499435/NDIGDZS024864.pdf\n",
      "http://purl.org/dc/elements/1.1/identifier → https://jbc.bj.uj.edu.pl/Content/499435/NDIGDZS024864.pdf\n",
      "\n",
      "--- DOCUMENT ---\n",
      "http://purl.org/dc/elements/1.1/subject → druki ulotne 20 w.\n",
      "http://purl.org/dc/elements/1.1/subject → Ciołkosz, Adam (1901-1978)\n",
      "http://purl.org/dc/elements/1.1/rights → Domena publiczna (public domain)\n",
      "http://purl.org/dc/elements/1.1/identifier → https://jbc.bj.uj.edu.pl/Content/510136/NDIGDZS023940.pdf\n",
      "http://purl.org/dc/elements/1.1/source → Biblioteka Jagiellońska, 639986 III 78\n",
      "http://purl.org/dc/elements/1.1/type → druk ulotny\n",
      "http://purl.org/dc/elements/1.1/issued → 1948\n",
      "http://purl.org/dc/elements/1.1/creator → Cambridge Anglo-Polish Society\n",
      "http://purl.org/dc/elements/1.1/title → Dr. Adam Ciolkosz [...] will speak on „Central & South-Eastern European Federation, is it possible, is it advisable?”\n",
      "http://purl.org/dc/elements/1.1/relation → oai:jbc.bj.uj.edu.pl:publication:535690\n",
      "http://purl.org/dc/elements/1.1/language → eng\n",
      "http://purl.org/dc/elements/1.1/date → 1948\n",
      "http://purl.org/dc/elements/1.1/coverage → 20 w.\n",
      "\n",
      "--- DOCUMENT ---\n",
      "http://purl.org/dc/elements/1.1/coverage → 20 w.\n",
      "http://purl.org/dc/elements/1.1/relation → oai:jbc.bj.uj.edu.pl:publication:535691\n",
      "http://purl.org/dc/elements/1.1/rights → Domena publiczna (public domain)\n",
      "http://purl.org/dc/elements/1.1/identifier → https://jbc.bj.uj.edu.pl/Content/510137/NDIGDZS023948.pdf\n",
      "http://purl.org/dc/elements/1.1/source → Biblioteka Jagiellońska, 639986 III 85\n",
      "http://purl.org/dc/elements/1.1/subject → druki ulotne 20 w.\n",
      "http://purl.org/dc/elements/1.1/title → British Fund for Warsaw : (under the auspices of the Poland Relief Fund)\n",
      "http://purl.org/dc/elements/1.1/issued → ca 1948\n",
      "http://purl.org/dc/elements/1.1/type → druk ulotny\n",
      "http://purl.org/dc/elements/1.1/date → ca 1948\n",
      "http://purl.org/dc/elements/1.1/language → eng\n",
      "\n",
      "--- DOCUMENT ---\n",
      "http://purl.org/dc/elements/1.1/issued → ca 1900\n",
      "http://purl.org/dc/elements/1.1/language → pol\n",
      "http://purl.org/dc/elements/1.1/relation → oai:jbc.bj.uj.edu.pl:publication:579328\n",
      "http://purl.org/dc/elements/1.1/subject → druki ulotne 19 w.\n",
      "http://purl.org/dc/elements/1.1/title → Kundmachung : Aussergewöhnliche Markt Anzeige\n",
      "http://purl.org/dc/elements/1.1/rights → Domena publiczna (public domain)\n",
      "http://purl.org/dc/elements/1.1/coverage → 19 w.\n",
      "http://purl.org/dc/elements/1.1/identifier → https://jbc.bj.uj.edu.pl/Content/550767/NDIGDZS019096.pdf\n",
      "http://purl.org/dc/elements/1.1/date → ca 1900\n",
      "http://purl.org/dc/elements/1.1/type → afisz\n",
      "http://purl.org/dc/elements/1.1/source → Biblioteka Jagiellońska, 224655 V 20\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# 5 przykładowych dokumentów\n",
    "\n",
    "sample = \"\"\"\n",
    "SELECT DISTINCT ?s WHERE {\n",
    "    ?s dc:title ?t .\n",
    "}\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "docs = [row[0] for row in g.query(sample, initNs={\"dc\": dc})]\n",
    "\n",
    "for doc in docs:\n",
    "    print(\"--- DOCUMENT ---\")\n",
    "    q = f\"\"\"\n",
    "    SELECT ?p ?o WHERE {{\n",
    "        <{doc}> ?p ?o .\n",
    "    }}\n",
    "    \"\"\"\n",
    "    for row in g.query(q):\n",
    "        print(row[0], \"→\", row[1])\n",
    "    print()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "174e5185",
   "metadata": {},
   "source": [
    "## Wnioski\n",
    "\n",
    "Lista wszytskich właściwości: title, creator, date, issued, description, coverage, subject, type, format, identifier, publisher, relation, language, source, rights\n",
    "\n",
    "**Co na pewno przyda się: title, date, description, subject, identifier**\n",
    "\n",
    "Co może się przyda: creator, issued, type, publisher, language\n",
    "\n",
    "Co się NIE przyda: coverage, format, relation, source, rights"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "1146d0a0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "**********dc:creator**********\n",
      "Gęsiak, Leszek\n",
      "Labour Party\n",
      "Cambridge Anglo-Polish Society\n",
      "\n",
      "**********dc:issued**********\n",
      "2004\n",
      "ca 1946\n",
      "1948\n",
      "ca 1948\n",
      "ca 1900\n",
      "1893\n",
      "ca 1882\n",
      "1879\n",
      "1860\n",
      "1859\n",
      "1872\n",
      "1874\n",
      "1884\n",
      "[1930-1936]\n",
      "[1878]\n",
      "1944\n",
      "[1901]\n",
      "[1896]\n",
      "1966\n",
      "1966\n",
      "\n",
      "**********dc:type**********\n",
      "rozprawa doktorska\n",
      "druk ulotny\n",
      "afisz\n",
      "plakat\n",
      "klepsydra\n",
      "\n",
      "**********dc:publisher**********\n",
      "Uniwersytet Jagielloński w Krakowie\n",
      "I. Związkowa Drukarnia\n",
      "Jermułowicz i Bergman\n",
      "M. Stochalski\n",
      "\n",
      "**********dc:language**********\n",
      "pol\n",
      "eng\n",
      "ger\n",
      "yid\n",
      "fre\n",
      "rus\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# sprawdzenie wartości dla niepewnych właściwości\n",
    "\n",
    "fields = [\"dc:creator\", \"dc:issued\", \"dc:type\", \"dc:publisher\", \"dc:language\"]\n",
    "\n",
    "dc = Namespace(\"http://purl.org/dc/elements/1.1/\")\n",
    "\n",
    "for field in fields:\n",
    "    q = f\"\"\"\n",
    "    SELECT DISTINCT ?value WHERE {{\n",
    "        ?s {field} ?value .\n",
    "    }}\n",
    "    LIMIT 20\n",
    "    \"\"\"\n",
    "    print(10*\"*\"+field+10*\"*\")\n",
    "    for row in g.query(q, initNs={\"dc\": dc}):\n",
    "        print(row[0])\n",
    "    print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "6b4dc3fa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Nie znaleziono żadnych różnic\n"
     ]
    }
   ],
   "source": [
    "# sprawdzenie różnic między dc:date i dc:issued\n",
    "\n",
    "query_diff_dates = \"\"\"\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "SELECT ?doc ?date ?issued\n",
    "WHERE {\n",
    "    ?doc dc:date ?date .\n",
    "    ?doc dc:issued ?issued .\n",
    "    FILTER(STR(?date) != STR(?issued))\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "results = g.query(query_diff_dates)\n",
    "\n",
    "for row in results:\n",
    "    print(\"Doc:\", row.doc)\n",
    "    print(\"  date:  \", row.date)\n",
    "    print(\"  issued:\", row.issued)\n",
    "    print()\n",
    "\n",
    "if len(results)==0:\n",
    "    print(\"Nie znaleziono żadnych różnic\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "89905382",
   "metadata": {},
   "source": [
    "## Lista wybranych cech\n",
    "title, date, description, subject, identifier"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "e7b56da2",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Przygotowanie wybranych metadanych w formacie json\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "SELECT ?doc ?title ?date ?description ?subject ?identifier\n",
    "WHERE {\n",
    "    ?doc dc:title ?title .\n",
    "\n",
    "    OPTIONAL { ?doc dc:date ?date . }\n",
    "    OPTIONAL { ?doc dc:description ?description . }\n",
    "    OPTIONAL { ?doc dc:subject ?subject . }\n",
    "    OPTIONAL { ?doc dc:identifier ?identifier . }\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "results = g.query(query)\n",
    "\n",
    "documents = {}\n",
    "\n",
    "for row in results:\n",
    "    doc_uri = str(row.doc)\n",
    "\n",
    "    if doc_uri not in documents:\n",
    "        documents[doc_uri] = {\n",
    "            \"title\": str(row.title),\n",
    "            \"date\": set(),\n",
    "            \"description\": set(),\n",
    "            \"subject\": set(),\n",
    "            \"identifier\": set()\n",
    "        }\n",
    "\n",
    "    if row.date:\n",
    "        documents[doc_uri][\"date\"].add(str(row.date))\n",
    "    if row.description:\n",
    "        documents[doc_uri][\"description\"].add(str(row.description))\n",
    "    if row.subject:\n",
    "        documents[doc_uri][\"subject\"].add(str(row.subject))\n",
    "    if row.identifier:\n",
    "        documents[doc_uri][\"identifier\"].add(str(row.identifier))\n",
    "\n",
    "# Zamiana setów na listy przed zapisaniem do JSON (sety były, żeby uniknąć duplikatów)\n",
    "for doc_uri, meta in documents.items():\n",
    "    meta[\"date\"] = list(meta[\"date\"])\n",
    "    meta[\"description\"] = list(meta[\"description\"])\n",
    "    meta[\"subject\"] = list(meta[\"subject\"])\n",
    "    meta[\"identifier\"] = list(meta[\"identifier\"])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "95e707bc",
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "\n",
    "with open(\"./data/jbc_data_raw.json\", \"w\", encoding=\"utf-8\") as f:\n",
    "    json.dump(documents, f, ensure_ascii=False, indent=2)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "e8baf4b1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "religion\n",
      "society\n",
      "wartości rdzenne\n",
      "state\n",
      "państwo\n",
      "core values\n",
      "wielokulturowość\n",
      "multiculturalism\n",
      "społeczeństwo\n",
      "religia\n",
      "laburzyści\n",
      "Partia Pracy (Wielka Brytania)\n",
      "druki ulotne 20 w.\n",
      "Ciołkosz, Adam (1901-1978)\n",
      "druki ulotne 19 w.\n",
      "Wydawnictwo „Czytelni Ludowej”\n",
      "Teatr Krakowski 19 w.\n",
      "Sienkiewicz, Henryk (1846-1916)\n",
      "Chaumont, Céline (1848-1926)\n",
      "Towarzystwo Paryskie\n",
      "Żuliński, Antoni\n",
      "Morstin, Ludwik Hieronim (1886-1966)\n",
      "Kopernik, Mikołaj (1473-1543)\n",
      "Frycz, Karol Józef (1877-1963)\n",
      "Kielanowski Leopold (1907-1988)\n",
      "Teatr im. Juliusza Słowackiego w Krakowie\n",
      "Polski Teatr Akademicki UJ\n",
      "koncert instrumentalny\n",
      "Pierwsza Związkowa Drukarnia (Lwów)\n",
      "koncert wokalny\n",
      "Mikuli, Karol (1819-1897)\n",
      "afisz muzyczny\n",
      "Stowarzyszenie Rękodzielników „Gwiazda”\n",
      "II wojna światowa (1939-1945)\n",
      "plakaty polityczne\n",
      "teatr 20 w.\n",
      "Shakespeare, William (1564-1616)\n",
      "Teatr Łódzki (Polska)\n",
      "teatr polski 19 w.\n",
      "Przybylski, Zygmunt\n",
      "socjologia\n",
      "duchowość\n",
      "Akademia Medyczna (Kraków)\n",
      "nabożeństwo żałobne\n",
      "pogrzeb\n",
      "Gastoł, Błażej (1905-1966)\n",
      "Collegium Medicum (Uniwersytet Jagielloński)\n",
      "Kraków (Polska ; region)\n",
      "nauczyciele akademiccy\n",
      "nauczyciele\n",
      "Gąsiorowska, Zofia (1885-1961)\n",
      "Gałek, Julian (1887-1960)\n",
      "Gawroński, Juliusz (1874-1967)\n",
      "Gawryś, Stanisław (1945-1991)\n",
      "Inglotowa, Elżbieta Krystyna (1902?-1978)\n",
      "Galas, Leokadia (?-1964)\n",
      "działacze partyjni\n",
      "Gaworek, Jadwiga (?-2004)\n",
      "druki ulotne 21 w.\n",
      "Związek Nauczycielstwa Polskiego\n",
      "Gawlikowski, Roman (1888-1963)\n",
      "Gawlikowski, Tadeusz (1889-1971)\n",
      "nauczyciele gimnazjów\n",
      "Gawryś, Stanisław (1901-1962)\n",
      "Gawłowska, Maria (1910-2010)\n",
      "Gawlikowska, Bronisława (1903?-1987)\n",
      "Gawrzyński, Kazimierz (1916-1971)\n",
      "Gawrzewski, Julian (1908-1984)\n",
      "Gawrzyńska, Teofila (1886-1959)\n",
      "Ilnicka, Julia (1905-1979)\n",
      "Florek, Mieczysław (1903-1970)\n",
      "Goliński, Jan (1903-1981)\n",
      "Gatty-Kostyal, Helena (1892-1979)\n",
      "Golonek, Karol (1890-1972)\n",
      "Gaudyn, Piotr (1884-1957)\n",
      "Gawalewicz, Adolf (1916-1987)\n",
      "Gólski, Stanisław Leon (1902-1985)\n",
      "Gaweł, Krystyna Marcela (1933-1971)\n",
      "oficerowie\n",
      "Gołębski, Adam (1898-1960)\n",
      "Gołębiowska, Rozalia (1899-1971)\n",
      "Gołębiowski, Franciszek (1908-1986)\n",
      "Gołdyn, Janusz (1920-1973)\n",
      "Gołda, Władysław (1901-1981)\n",
      "Gaweł, Krzysztof (1952-1978)\n",
      "Gaweski, Bohdan Antoni (1904-1967)\n",
      "Gołda, Franciszek (1923-1996)\n",
      "Gawlik, Aleksandra (1934-1986)\n",
      "Gawlik, Aleksander (1930-1980)\n",
      "Gołąb, Jakub (1901-1971)\n",
      "Gólski, Stanisław (1877-1960)\n",
      "Gołąb, Walenty (1895-1980)\n",
      "Gołąb, Henryk (1921-1988)\n",
      "Gołąb, Michał (1910-1984)\n",
      "Gawlik, Stanisław (1894-1972)\n",
      "Gawlik, Andrzej (1934-1984)\n",
      "Florek, Mieczysław (1918-1978)\n",
      "Gierowska, Danuta (1921-1984)\n",
      "Gierowski, Józef Andrzej (1922-2006)\n",
      "Gierula, Jerzy (1917-1975)\n"
     ]
    }
   ],
   "source": [
    "# sprawdzenie 100 wartości \"subject\"\n",
    "\n",
    "dc = Namespace(\"http://purl.org/dc/elements/1.1/\")\n",
    "\n",
    "q = f\"\"\"\n",
    "SELECT DISTINCT ?value WHERE {{\n",
    "    ?s dc:subject ?value .\n",
    "}}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "for row in g.query(q, initNs={\"dc\": dc}):\n",
    "    print(row[0])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1ffc55a5",
   "metadata": {},
   "source": [
    "# Rozszerzona lista cech\n",
    "title, date, description, subject, identifier, creator, publisher, type"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
