{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "137b3ca8",
   "metadata": {},
   "source": [
    "# Opis\n",
    "Ten notes zawiera funkcje do łączenia i eksplorowania danych. Najpierw dane łączone są w jeden graf wiedzy, a następnie wykonywane są na nich różne zapytania.\n",
    "## Opisy poszczególnych funkcji\n",
    "\n",
    "- create_graph(directory_path_with_rdfs)\n",
    "\n",
    "    Tworzy graf z danymi z plików `.rdf`.\n",
    "\n",
    "    Wymagane parametry:\n",
    "    - **directory_path_with_rdfs** - ścieżka do folderu z plikami w formacie `.rdf`\n",
    "\n",
    "- visualise_graph(graph):\n",
    "\n",
    "    Tworzy plik html z wizualizacją grafu.\n",
    "\n",
    "    Wymagane parametry:\n",
    "    - **graph** - graph stworzony przez `create_graph()`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "bd33f286",
   "metadata": {},
   "outputs": [],
   "source": [
    "from rdflib import Graph, Namespace\n",
    "import glob"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "3345de9c",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_graph(directory_path_with_rdfs, generate_files):\n",
    "    graph = Graph()\n",
    "\n",
    "    for rdf_file in glob.glob(directory_path_with_rdfs):\n",
    "        graph.parse(rdf_file)\n",
    "    print(f\"Łącznie wczytano {len(graph)} trójek.\")\n",
    "\n",
    "    if generate_files:\n",
    "        graph.serialize(\"./data/merged_graph.rdf\", format=\"xml\")\n",
    "        graph.serialize(\"./data/merged_graph_turtle.ttl\", format=\"turtle\")\n",
    "\n",
    "    return graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "ca9b9d4a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Łącznie wczytano 3388 trójek.\n"
     ]
    }
   ],
   "source": [
    "rdfs_directory_path = \"./data/part1/*rdf\"\n",
    "g = create_graph(rdfs_directory_path, False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "56d93b9e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://purl.org/dc/elements/1.1/coverage\n",
      "http://purl.org/dc/elements/1.1/creator\n",
      "http://purl.org/dc/elements/1.1/date\n",
      "http://purl.org/dc/elements/1.1/description\n",
      "http://purl.org/dc/elements/1.1/format\n",
      "http://purl.org/dc/elements/1.1/identifier\n",
      "http://purl.org/dc/elements/1.1/issued\n",
      "http://purl.org/dc/elements/1.1/language\n",
      "http://purl.org/dc/elements/1.1/publisher\n",
      "http://purl.org/dc/elements/1.1/relation\n",
      "http://purl.org/dc/elements/1.1/rights\n",
      "http://purl.org/dc/elements/1.1/source\n",
      "http://purl.org/dc/elements/1.1/subject\n",
      "http://purl.org/dc/elements/1.1/title\n",
      "http://purl.org/dc/elements/1.1/type\n"
     ]
    }
   ],
   "source": [
    "# właściwości używane w grafie\n",
    "\n",
    "q = \"\"\"\n",
    "SELECT DISTINCT ?p WHERE {\n",
    "    ?s ?p ?o .\n",
    "}\n",
    "ORDER BY ?p\n",
    "\"\"\"\n",
    "for row in g.query(q):\n",
    "    print(row[0])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "a62938e0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "**********dc:coverage**********\n",
      "20 w.\n",
      "19 w.\n",
      "19-20 w.\n",
      "20-21 w.\n",
      "\n",
      "**********dc:type**********\n",
      "rozprawa doktorska\n",
      "druk ulotny\n",
      "afisz\n",
      "plakat\n",
      "klepsydra\n",
      "\n",
      "**********dc:creator**********\n",
      "Gęsiak, Leszek\n",
      "Labour Party\n",
      "Cambridge Anglo-Polish Society\n",
      "\n",
      "**********dc:format**********\n",
      "image/x.djvu\n",
      "image/x.djvu\n",
      "application/octet-stream\n",
      "application/octet-stream\n",
      "pdf\n",
      "\n",
      "**********dc:publisher**********\n",
      "Uniwersytet Jagielloński w Krakowie\n",
      "I. Związkowa Drukarnia\n",
      "Jermułowicz i Bergman\n",
      "M. Stochalski\n",
      "\n",
      "**********dc:relation**********\n",
      "oai:jbc.bj.uj.edu.pl:publication:180039\n",
      "oai:jbc.bj.uj.edu.pl:publication:180039\n",
      "oai:jbc.bj.uj.edu.pl:publication:421001\n",
      "oai:jbc.bj.uj.edu.pl:publication:421001\n",
      "oai:jbc.bj.uj.edu.pl:publication:535690\n",
      "oai:jbc.bj.uj.edu.pl:publication:535691\n",
      "oai:jbc.bj.uj.edu.pl:publication:579328\n",
      "oai:jbc.bj.uj.edu.pl:publication:579397\n",
      "oai:jbc.bj.uj.edu.pl:publication:579399\n",
      "oai:jbc.bj.uj.edu.pl:publication:579419\n",
      "oai:jbc.bj.uj.edu.pl:publication:599804\n",
      "oai:jbc.bj.uj.edu.pl:publication:599842\n",
      "oai:jbc.bj.uj.edu.pl:publication:599998\n",
      "oai:jbc.bj.uj.edu.pl:publication:600001\n",
      "oai:jbc.bj.uj.edu.pl:publication:600002\n",
      "oai:jbc.bj.uj.edu.pl:publication:600330\n",
      "oai:jbc.bj.uj.edu.pl:publication:600353\n",
      "oai:jbc.bj.uj.edu.pl:publication:601649\n",
      "oai:jbc.bj.uj.edu.pl:publication:601724\n",
      "https://audiovis.nac.gov.pl/search/bce12eb58b7c438c284cce758f457f0c:1/ Zobacz w NAC, Fragment przedstawienia Ludwika Hieronima Morstina „Mikołaj Kopernik” (1936-1937)\n",
      "\n",
      "**********dc:subject**********\n",
      "religion\n",
      "society\n",
      "wartości rdzenne\n",
      "state\n",
      "państwo\n",
      "core values\n",
      "wielokulturowość\n",
      "multiculturalism\n",
      "społeczeństwo\n",
      "religia\n",
      "laburzyści\n",
      "Partia Pracy (Wielka Brytania)\n",
      "druki ulotne 20 w.\n",
      "Ciołkosz, Adam (1901-1978)\n",
      "druki ulotne 19 w.\n",
      "Wydawnictwo „Czytelni Ludowej”\n",
      "Teatr Krakowski 19 w.\n",
      "Sienkiewicz, Henryk (1846-1916)\n",
      "Chaumont, Céline (1848-1926)\n",
      "Towarzystwo Paryskie\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# sprawdzenie wartości dla kilku właściwości\n",
    "\n",
    "fields = [\"dc:coverage\", \"dc:type\", \"dc:creator\", \"dc:format\", \"dc:publisher\", \"dc:relation\", \"dc:subject\"]\n",
    "\n",
    "dc = Namespace(\"http://purl.org/dc/elements/1.1/\")\n",
    "\n",
    "for field in fields:\n",
    "    q = f\"\"\"\n",
    "    SELECT DISTINCT ?value WHERE {{\n",
    "        ?s {field} ?value .\n",
    "    }}\n",
    "    LIMIT 20\n",
    "    \"\"\"\n",
    "    print(10*\"*\"+field+10*\"*\")\n",
    "    for row in g.query(q, initNs={\"dc\": dc}):\n",
    "        print(row[0])\n",
    "    print()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3070b1d8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "--- DOCUMENT ---\n",
      "http://purl.org/dc/elements/1.1/publisher → Uniwersytet Jagielloński w Krakowie\n",
      "http://purl.org/dc/elements/1.1/subject → religion\n",
      "http://purl.org/dc/elements/1.1/subject → society\n",
      "http://purl.org/dc/elements/1.1/subject → wartości rdzenne\n",
      "http://purl.org/dc/elements/1.1/subject → state\n",
      "http://purl.org/dc/elements/1.1/subject → państwo\n",
      "http://purl.org/dc/elements/1.1/subject → core values\n",
      "http://purl.org/dc/elements/1.1/subject → wielokulturowość\n",
      "http://purl.org/dc/elements/1.1/subject → multiculturalism\n",
      "http://purl.org/dc/elements/1.1/subject → społeczeństwo\n",
      "http://purl.org/dc/elements/1.1/subject → religia\n",
      "http://purl.org/dc/elements/1.1/relation → oai:jbc.bj.uj.edu.pl:publication:180039\n",
      "http://purl.org/dc/elements/1.1/relation → oai:jbc.bj.uj.edu.pl:publication:180039\n",
      "http://purl.org/dc/elements/1.1/format → image/x.djvu\n",
      "http://purl.org/dc/elements/1.1/format → image/x.djvu\n",
      "http://purl.org/dc/elements/1.1/creator → Gęsiak, Leszek\n",
      "http://purl.org/dc/elements/1.1/source → Archiwum UJ, Dokt. 2004/193\n",
      "http://purl.org/dc/elements/1.1/rights → Copyright\n",
      "http://purl.org/dc/elements/1.1/issued → 2004\n",
      "http://purl.org/dc/elements/1.1/type → rozprawa doktorska\n",
      "http://purl.org/dc/elements/1.1/title → Wielokulturowość - rola religii w dynamice zjawiska\n",
      "http://purl.org/dc/elements/1.1/date → 2004\n",
      "http://purl.org/dc/elements/1.1/language → pol\n",
      "\n",
      "--- DOCUMENT ---\n",
      "http://purl.org/dc/elements/1.1/title → „Your Future”\n",
      "http://purl.org/dc/elements/1.1/source → Biblioteka Jagiellońska, 639986 III 110\n",
      "http://purl.org/dc/elements/1.1/date → ca 1946\n",
      "http://purl.org/dc/elements/1.1/issued → ca 1946\n",
      "http://purl.org/dc/elements/1.1/relation → oai:jbc.bj.uj.edu.pl:publication:421001\n",
      "http://purl.org/dc/elements/1.1/relation → oai:jbc.bj.uj.edu.pl:publication:421001\n",
      "http://purl.org/dc/elements/1.1/language → eng\n",
      "http://purl.org/dc/elements/1.1/creator → Labour Party\n",
      "http://purl.org/dc/elements/1.1/subject → laburzyści\n",
      "http://purl.org/dc/elements/1.1/subject → Partia Pracy (Wielka Brytania)\n",
      "http://purl.org/dc/elements/1.1/subject → druki ulotne 20 w.\n",
      "http://purl.org/dc/elements/1.1/coverage → 20 w.\n",
      "http://purl.org/dc/elements/1.1/type → druk ulotny\n",
      "http://purl.org/dc/elements/1.1/rights → Domena publiczna (public domain)\n",
      "http://purl.org/dc/elements/1.1/format → application/octet-stream\n",
      "http://purl.org/dc/elements/1.1/format → application/octet-stream\n",
      "http://purl.org/dc/elements/1.1/identifier → https://jbc.bj.uj.edu.pl/Content/499435/NDIGDZS024864.pdf\n",
      "http://purl.org/dc/elements/1.1/identifier → https://jbc.bj.uj.edu.pl/Content/499435/NDIGDZS024864.pdf\n",
      "\n",
      "--- DOCUMENT ---\n",
      "http://purl.org/dc/elements/1.1/subject → druki ulotne 20 w.\n",
      "http://purl.org/dc/elements/1.1/subject → Ciołkosz, Adam (1901-1978)\n",
      "http://purl.org/dc/elements/1.1/rights → Domena publiczna (public domain)\n",
      "http://purl.org/dc/elements/1.1/identifier → https://jbc.bj.uj.edu.pl/Content/510136/NDIGDZS023940.pdf\n",
      "http://purl.org/dc/elements/1.1/source → Biblioteka Jagiellońska, 639986 III 78\n",
      "http://purl.org/dc/elements/1.1/type → druk ulotny\n",
      "http://purl.org/dc/elements/1.1/issued → 1948\n",
      "http://purl.org/dc/elements/1.1/creator → Cambridge Anglo-Polish Society\n",
      "http://purl.org/dc/elements/1.1/title → Dr. Adam Ciolkosz [...] will speak on „Central & South-Eastern European Federation, is it possible, is it advisable?”\n",
      "http://purl.org/dc/elements/1.1/relation → oai:jbc.bj.uj.edu.pl:publication:535690\n",
      "http://purl.org/dc/elements/1.1/language → eng\n",
      "http://purl.org/dc/elements/1.1/date → 1948\n",
      "http://purl.org/dc/elements/1.1/coverage → 20 w.\n",
      "\n",
      "--- DOCUMENT ---\n",
      "http://purl.org/dc/elements/1.1/coverage → 20 w.\n",
      "http://purl.org/dc/elements/1.1/relation → oai:jbc.bj.uj.edu.pl:publication:535691\n",
      "http://purl.org/dc/elements/1.1/rights → Domena publiczna (public domain)\n",
      "http://purl.org/dc/elements/1.1/identifier → https://jbc.bj.uj.edu.pl/Content/510137/NDIGDZS023948.pdf\n",
      "http://purl.org/dc/elements/1.1/source → Biblioteka Jagiellońska, 639986 III 85\n",
      "http://purl.org/dc/elements/1.1/subject → druki ulotne 20 w.\n",
      "http://purl.org/dc/elements/1.1/title → British Fund for Warsaw : (under the auspices of the Poland Relief Fund)\n",
      "http://purl.org/dc/elements/1.1/issued → ca 1948\n",
      "http://purl.org/dc/elements/1.1/type → druk ulotny\n",
      "http://purl.org/dc/elements/1.1/date → ca 1948\n",
      "http://purl.org/dc/elements/1.1/language → eng\n",
      "\n",
      "--- DOCUMENT ---\n",
      "http://purl.org/dc/elements/1.1/issued → ca 1900\n",
      "http://purl.org/dc/elements/1.1/language → pol\n",
      "http://purl.org/dc/elements/1.1/relation → oai:jbc.bj.uj.edu.pl:publication:579328\n",
      "http://purl.org/dc/elements/1.1/subject → druki ulotne 19 w.\n",
      "http://purl.org/dc/elements/1.1/title → Kundmachung : Aussergewöhnliche Markt Anzeige\n",
      "http://purl.org/dc/elements/1.1/rights → Domena publiczna (public domain)\n",
      "http://purl.org/dc/elements/1.1/coverage → 19 w.\n",
      "http://purl.org/dc/elements/1.1/identifier → https://jbc.bj.uj.edu.pl/Content/550767/NDIGDZS019096.pdf\n",
      "http://purl.org/dc/elements/1.1/date → ca 1900\n",
      "http://purl.org/dc/elements/1.1/type → afisz\n",
      "http://purl.org/dc/elements/1.1/source → Biblioteka Jagiellońska, 224655 V 20\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# 5 przykładowych dokumentów\n",
    "\n",
    "sample = \"\"\"\n",
    "SELECT DISTINCT ?s WHERE {\n",
    "    ?s dc:title ?t .\n",
    "}\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "docs = [row[0] for row in g.query(sample, initNs={\"dc\": dc})]\n",
    "\n",
    "for doc in docs:\n",
    "    print(\"--- DOCUMENT ---\")\n",
    "    q = f\"\"\"\n",
    "    SELECT ?p ?o WHERE {{\n",
    "        <{doc}> ?p ?o .\n",
    "    }}\n",
    "    \"\"\"\n",
    "    for row in g.query(q):\n",
    "        print(row[0], \"→\", row[1])\n",
    "    print()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "174e5185",
   "metadata": {},
   "source": [
    "## Wnioski\n",
    "\n",
    "Lista wszytskich właściwości: title, creator, date, issued, description, coverage, subject, type, format, identifier, publisher, relation, language, source, rights\n",
    "\n",
    "**Co na pewno przyda się: title, date, description, subject, identifier**\n",
    "\n",
    "Co może się przyda: creator, issued, type, publisher, language\n",
    "\n",
    "Co się NIE przyda: coverage, format, relation, source, rights"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "1146d0a0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "**********dc:creator**********\n",
      "Gęsiak, Leszek\n",
      "Labour Party\n",
      "Cambridge Anglo-Polish Society\n",
      "\n",
      "**********dc:issued**********\n",
      "2004\n",
      "ca 1946\n",
      "1948\n",
      "ca 1948\n",
      "ca 1900\n",
      "1893\n",
      "ca 1882\n",
      "1879\n",
      "1860\n",
      "1859\n",
      "1872\n",
      "1874\n",
      "1884\n",
      "[1930-1936]\n",
      "[1878]\n",
      "1944\n",
      "[1901]\n",
      "[1896]\n",
      "1966\n",
      "1966\n",
      "\n",
      "**********dc:type**********\n",
      "rozprawa doktorska\n",
      "druk ulotny\n",
      "afisz\n",
      "plakat\n",
      "klepsydra\n",
      "\n",
      "**********dc:publisher**********\n",
      "Uniwersytet Jagielloński w Krakowie\n",
      "I. Związkowa Drukarnia\n",
      "Jermułowicz i Bergman\n",
      "M. Stochalski\n",
      "\n",
      "**********dc:language**********\n",
      "pol\n",
      "eng\n",
      "ger\n",
      "yid\n",
      "fre\n",
      "rus\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# sprawdzenie wartości dla niepewnych właściwości\n",
    "\n",
    "fields = [\"dc:creator\", \"dc:issued\", \"dc:type\", \"dc:publisher\", \"dc:language\"]\n",
    "\n",
    "dc = Namespace(\"http://purl.org/dc/elements/1.1/\")\n",
    "\n",
    "for field in fields:\n",
    "    q = f\"\"\"\n",
    "    SELECT DISTINCT ?value WHERE {{\n",
    "        ?s {field} ?value .\n",
    "    }}\n",
    "    LIMIT 20\n",
    "    \"\"\"\n",
    "    print(10*\"*\"+field+10*\"*\")\n",
    "    for row in g.query(q, initNs={\"dc\": dc}):\n",
    "        print(row[0])\n",
    "    print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "fca8d960",
   "metadata": {},
   "outputs": [],
   "source": [
    "# NIE DZIAŁA DLA DUŻEJ LICZBY DANYCH - GRAF JEST NIECZYTELNY\n",
    "\n",
    "from pyvis.network import Network\n",
    "\n",
    "def visualise_graph(graph):\n",
    "    net = Network(notebook=False, directed=True)\n",
    "    net.toggle_physics(False)\n",
    "\n",
    "    for s, p, o in graph:\n",
    "        net.add_node(str(s), title=str(s))\n",
    "        net.add_node(str(o), title=str(o))\n",
    "        net.add_edge(str(s), str(o), title=str(p))\n",
    "\n",
    "    net.write_html(\"graf_jbc.html\")\n",
    "\n",
    "#visualise_graph(g)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
